<?php

namespace App\Models;

use T4\Orm\Model;

class Artist extends Model
{
    const IMAGE_UPLOAD_PATH = '/public/artists/images';
    const IMAGE_PROPERTY = 'image';
    use THasImage;

    static protected $schema = [
        'table' => 'artists',
        'columns' => [
            'name' => ['type' => 'string'],
            'image' => ['type' => 'string'],
        ],
        'relations' => [
            'songs' => ['type' => self::HAS_MANY, 'model' => Song::class]
        ]
    ];


    public static function findAllSortedBash()
    {
        $artists = Artist::findAll();
        $sorted = $artists->sort(
            function ($a, $b) {

                $alphabet = [
                    'А' => 0, 'а' => 1, 'Б' => 2, 'б' => 3, 'В' => 4, 'в' => 5, 'Г' => 6, 'г' => 7, 'Ғ' => 8, 'ғ' => 9, 'Д' => 10, 'д' => 11, 'Ҙ' => 12, 'ҙ' => 13, 'Е' => 14, 'е' => 15, 'Ж' => 16, 'ж' => 17, 'З' => 18, 'з' => 19, 'И' => 20, 'и' => 21, 'Й' => 22, 'й' => 23, 'К' => 24, 'к' => 25, 'Ҡ' => 26, 'ҡ' => 27, 'Л' => 28, 'л' => 29, 'М' => 30, 'м' => 31,
                    'Н' => 32, 'н' => 33, 'Ң' => 34, 'ң' => 35, 'О' => 36, 'о' => 37, 'Ө' => 38, 'ө' => 39, 'П' => 40, 'п' => 41, 'Р' => 42, 'р' => 43, 'С' => 44, 'с' => 45, 'Ҫ' => 46, 'ҫ' => 47, 'Т' => 48, 'т' => 49, 'У' => 50, 'у' => 51, 'Ү' => 52, 'ү' => 53, 'Ф' => 54, 'ф' => 55, 'Х' => 56, 'х' => 57, 'Һ' => 58, 'һ' => 59, 'Ц' => 60, 'ц' => 61, 'Ч' => 62, 'ч' => 63,
                    'Ш' => 64, 'ш' => 65, 'Щ' => 66, 'щ' => 67, 'Ъ' => 68, 'ъ' => 69, 'Ы' => 70, 'ы' => 71, 'Ь' => 72, 'ь' => 73, 'Э' => 74, 'э' => 75, 'Ә' => 76, 'ә' => 77, 'Ю' => 78, 'ю' => 79, 'Я' => 80, 'я' => 81, 'A' => 82, 'a' => 83, 'B' => 84, 'b' => 85, 'C' => 86, 'c' => 87, 'D' => 88, 'd' => 89, 'E' => 90, 'e' => 91,
                    'F' => 92, 'f' => 93, 'G' => 94, 'g' => 95, 'H' => 96, 'h' => 97, 'I' => 98, 'i' => 99, 'J' => 100, 'j' => 101, 'K' => 102, 'k' => 103, 'L' => 104, 'l' => 105, 'M' => 106, 'm' => 107, 'N' => 108, 'n' => 108, 'O' => 109, 'o' => 110, 'P' => 111, 'p' => 112, 'Q' => 113, 'q' => 114, 'R' => 115, 'r' => 116, 'S' => 117, 's' => 118, 'T' => 119, 't' => 120,
                    'U' => 121, 'u' => 122, 'V' => 123, 'v' => 124, 'W' => 125, 'w' => 126, 'X' => 127, 'x' => 128, 'Y' => 129, 'y' => 130, 'Z' => 131, 'z' => 132, 0 => 133, 1 => 134, 2 => 135, 3 => 136, 4 => 137, 5 => 138, 6 => 139, 7 => 140, 8 => 141, 9 => 142,
                ];

                return $alphabet[substr($a->name, 0, 2)] <=> $alphabet[substr($b->name, 0, 2)];
            }
        );

        return $sorted;
    }
}
